package com.egorovfond.artillery.data.localTable
import com.egorovfond.artillery.math.Table

class LocalTableSPG9 {
    companion object {
        val table = mutableListOf(
            Table(false,"ОГ-9В",200,10,22f,3f,0f,0f,0f,0f,1f,0f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",300,14,21f,3f,0f,0f,0f,0f,1f,0f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",400,19,21f,3f,0f,0f,0f,0f,1f,0f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",500,24,21f,3f,0f,0f,0f,0f,2f,0f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",600,29,20f,3f,0f,0f,0f,0f,2f,0f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",700,34,20f,3f,0f,0f,0f,0f,3f,0f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",800,40,19f,3f,0f,0f,0f,0f,4f,1f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",900,45,19f,3f,0f,0f,0f,0f,4f,1f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1000,50,19f,3f,0f,0f,0f,1f,5f,1f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1100,56,18f,3f,0f,0f,0f,1f,6f,1f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1200,62,18f,3f,0f,0f,0f,1f,7f,1f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1300,67,17f,3f,0f,0f,0f,1f,8f,2f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1400,73,17f,3f,1f,0f,0f,1f,9f,2f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1500,79,17f,4f,1f,0f,0f,1f,10f,2f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1600,86,16f,4f,1f,0f,0f,1f,11f,2f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1700,92,16f,4f,1f,0f,0f,2f,12f,3f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1800,98,16f,4f,1f,0f,0f,2f,14f,3f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",1900,105,15f,4f,1f,0f,0f,2f,15f,3f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2000,112,15f,4f,1f,0f,0f,2f,16f,4f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2100,119,15f,4f,1f,0f,1f,2f,18f,4f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2200,126,14f,4f,1f,0f,1f,3f,19f,4f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2300,133,14f,4f,1f,0f,1f,3f,21f,5f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2400,141,13f,4f,2f,0f,1f,3f,22f,5f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2500,149,13f,4f,2f,0f,1f,3f,24f,6f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2600,157,13f,5f,2f,0f,1f,4f,25f,6f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2700,165,12f,5f,2f,0f,1f,4f,27f,6f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2800,174,12f,5f,2f,0f,1f,4f,29f,7f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",2900,182,12f,5f,2f,0f,1f,5f,31f,7f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3000,191,11f,5f,2f,0f,1f,5f,33f,8f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3100,201,11f,5f,3f,0f,1f,5f,35f,8f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3200,210,11f,5f,3f,0f,1f,6f,36f,9f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3300,220,10f,5f,3f,0f,1f,6f,38f,9f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3400,230,10f,6f,3f,0f,1f,6f,40f,10f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3500,241,10f,6f,3f,0f,1f,7f,43f,11f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3600,252,9f,6f,3f,0f,1f,7f,45f,11f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3700,263,9f,6f,3f,0f,1f,8f,47f,12f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3800,275,9f,7f,4f,0f,1f,8f,49f,12f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",3900,288,8f,7f,4f,0f,1f,9f,51f,13f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",4000,301,8f,7f,4f,0f,1f,9f,54f,14f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",4100,314,8f,7f,4f,0f,1f,10f,56f,14f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",4200,329,7f,8f,5f,0f,1f,10f,58f,15f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",4300,344,7f,8f,5f,0f,1f,11f,61f,16f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",4400,360,6f,9f,6f,0f,1f,11f,63f,16f,0,"0м/15С/1013.25гПа",15f,1013.25f,0),
            Table(false,"ОГ-9В",4500,377,6f,9f,6f,0f,1f,12f,66f,17f,0,"0м/15С/1013.25гПа",15f,1013.25f,0)
        )
    }
}